## Install Libraries

In [2]:
!pip install sqlalchemy
!pip install pymysql
!pip install ipython-sql
!pip install mysql-connector-python

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy in c:\users\pedrosa\appdata\roaming\python\python39\site-packages (2.0.7)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\pedrosa\appdata\roaming\python\python39\site-packages (from sqlalchemy) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\pedrosa\appdata\roaming\python\python39\site-packages (from sqlalchemy) (4.5.0)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in c:\users\pedrosa\appdata\roaming\python\python39\site-packages (1.0.3)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ipython-sql in c:\users\pedrosa\appdata\roaming\python\python39\site-packages (0.5.0)
Requirement already satisfied: ipython in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: sqlparse in c:\users\pedrosa\appdata\roaming\python\python39\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: ipython-genutils in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: six in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: prettytable in c:\users\pedrosa\appdata\roaming\python\python39\site-packages (from ipython-sql) (3.6.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\pedrosa\appdata\roaming\python\python39\site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\pedrosa\appdata\roaming\python\python39\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\pedrosa\appdata\roaming\python\python39\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: traitlets>=4.2 in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: pygments in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: setuptools>=18.5 in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (63.4.1)
Requirement already satisfied: jedi>=0.16 in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: pickleshare in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.5)
Requirement already satisfied: decorator in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: matplotlib-inline in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: wcwidth in c:\programdata\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\programdata\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: mysql-connector-python in c:\users\pedrosa\appdata\roaming\python\python39\site-packages (8.0.32)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\pedrosa\appdata\roaming\python\python39\site-packages (from mysql-connector-python) (3.20.3)

In [3]:
#loading ipython-sql library
%load_ext sql

## DB Connection

In [4]:
#%sql mysql+pymysql://user:password@host/db

## Joins

### Question 1: Write and execute a SQL query to list the school names, community names and average attendance for communities with a hardship index of 98.

In [37]:
%%sql
SELECT
        S.NAME_OF_SCHOOL,
        S.COMMUNITY_AREA_NAME,
        S.AVERAGE_STUDENT_ATTENDANCE
    FROM CHICAGO_PUBLIC_SCHOOLS S
    LEFT JOIN CENSUS_DATA C
    ON C.COMMUNITY_AREA_NUMBER = S.COMMUNITY_AREA_NUMBER
    WHERE C.HARDSHIP_INDEX = 98;

 * mysql+pymysql://admin:***@database-1.cxbcxwezo94b.us-east-1.rds.amazonaws.com/ibm_database
4 rows affected.

[('George Washington Carver Military Academy High School', 'RIVERDALE', '91.60%'),
 ('George Washington Carver Primary School', 'RIVERDALE', '90.90%'),
 ('Ira F Aldridge Elementary School', 'RIVERDALE', '92.90%'),
 ('William E B Dubois Elementary School', 'RIVERDALE', '93.30%')]

### Question 2: Write and execute a SQL query to list all crimes that took place at a school. Include case number, crime type and community name.

In [38]:
%%sql
SELECT
        CR.CASE_NUMBER,
        CR.PRIMARY_TYPE,
        CE.COMMUNITY_AREA_NAME
    FROM CHICAGO_CRIME_DATA CR
    JOIN CENSUS_DATA CE
    ON CR.COMMUNITY_AREA_NUMBER = CE.COMMUNITY_AREA_NUMBER
    WHERE LOCATION_DESCRIPTION LIKE '%SCHOOL%'
    ORDER BY CR.PRIMARY_TYPE;

 * mysql+pymysql://admin:***@database-1.cxbcxwezo94b.us-east-1.rds.amazonaws.com/ibm_database
12 rows affected.

[('HT315369', 'ASSAULT', 'East Garfield Park'),
 ('HL725506', 'BATTERY', 'Lincoln Square'),
 ('HH639427', 'BATTERY', 'Austin'),
 ('HP716225', 'BATTERY', 'Douglas'),
 ('HL353697', 'BATTERY', 'South Shore'),
 ('JA460432', 'BATTERY', 'Ashburn'),
 ('HS200939', 'CRIMINAL DAMAGE', 'Austin'),
 ('HR585012', 'CRIMINAL TRESPASS', 'Ashburn'),
 ('HK577020', 'NARCOTICS', 'Rogers Park'),
 ('HS305355', 'NARCOTICS', 'Brighton Park'),
 ('G635735', 'PUBLIC PEACE VIOLATION', 'CHICAGO'),
 ('HH292682', 'PUBLIC PEACE VIOLATION', 'CHICAGO')]

# Views

### Question 1: Write and execute a SQL statement to create a view showing the columns listed in the following table, with new column names as shown in the second column.

| Column name in CHICAGO_PUBLIC_SCHOOLS	| Column name in view |
| --- | --- |
| NAME_OF_SCHOOL	| School_Name |
| Safety_Icon	| Safety_Rating |
| Family_Involvement_Icon |	Family_Rating |
| Environment_Icon	| Environment_Rating |
| Instruction_Icon	| Instruction_Rating |
| Leaders_Icon	| Leaders_Rating |
| Teachers_Icon	| Teachers_Rating |

In [61]:
%%sql

CREATE OR REPLACE VIEW v_public_schools 
(School_Name, Safety_Rating, Family_Rating, Environment_Rating, Instruction_Rating, Leaders_Rating, Teachers_Rating)
    AS SELECT
        NAME_OF_SCHOOL,
        Safety_Icon,
        Family_Involvement_Icon,
        Environment_Icon,
        Instruction_Icon,
        Leaders_Icon,
        Teachers_Icon
    FROM CHICAGO_PUBLIC_SCHOOLS;

 * mysql+pymysql://admin:***@database-1.cxbcxwezo94b.us-east-1.rds.amazonaws.com/ibm_database
0 rows affected.

[]

### Question 2: Write and execute a SQL statement that returns all of the columns from the view.

In [67]:
%%sql
SELECT 
    * 
FROM v_public_schools
LIMIT 10;

 * mysql+pymysql://admin:***@database-1.cxbcxwezo94b.us-east-1.rds.amazonaws.com/ibm_database
10 rows affected.

[('Abraham Lincoln Elementary School', 'Very Strong', 'Very Strong', 'Strong', 'Strong', 'Weak', 'Strong'),
 ('Adam Clayton Powell Paideia Community Academy Elementary School', 'Average', 'Strong', 'Strong', 'Very Strong', 'Weak', 'Strong'),
 ('Adlai E Stevenson Elementary School', 'Strong', 'NDA', 'Average', 'Weak', 'Weak', 'NDA'),
 ('Agustin Lara Elementary Academy', 'Average', 'Average', 'Average', 'Weak', 'Weak', 'Average'),
 ('Air Force Academy High School', 'Average', 'Strong', 'Strong', 'Average', 'Weak', 'Average'),
 ('Albany Park Multicultural Academy', 'Strong', 'Weak', 'Strong', 'Strong', 'Weak', 'Average'),
 ('Albert G Lane Technical High School', 'Very Strong', 'NDA', 'Strong', 'Average', 'Weak', 'NDA'),
 ('Albert R Sabin Elementary Magnet School', 'Strong', 'NDA', 'Weak', 'Very Weak', 'Weak', 'NDA'),
 ('Alcott High School for the Humanities', 'Strong', 'NDA', 'Strong', 'Average', 'Weak', 'NDA'),
 ('Alessandro Volta Elementary School', 'Average', 'Strong', 'Weak', 'Weak', 'Weak', 'Average')]

### Question 3: Write and execute a SQL statement that returns just the school name and leaders rating from the view.

In [65]:
%%sql
SELECT
        School_Name,
        Leaders_Rating
    FROM v_public_schools
    LIMIT 10;

 * mysql+pymysql://admin:***@database-1.cxbcxwezo94b.us-east-1.rds.amazonaws.com/ibm_database
10 rows affected.

[('Abraham Lincoln Elementary School', 'Weak'),
 ('Adam Clayton Powell Paideia Community Academy Elementary School', 'Weak'),
 ('Adlai E Stevenson Elementary School', 'Weak'),
 ('Agustin Lara Elementary Academy', 'Weak'),
 ('Air Force Academy High School', 'Weak'),
 ('Albany Park Multicultural Academy', 'Weak'),
 ('Albert G Lane Technical High School', 'Weak'),
 ('Albert R Sabin Elementary Magnet School', 'Weak'),
 ('Alcott High School for the Humanities', 'Weak'),
 ('Alessandro Volta Elementary School', 'Weak')]

## Stored Procedures

### Question 1: Write the structure of a query to create or replace a stored procedure called UPDATE_LEADERS_SCORE that takes a in_School_ID parameter as an integer and a in_Leader_Score parameter as an integer. Don’t forget to use the #SET TERMINATOR statement to use the @ for the CREATE statement terminator.

In [ ]:
--#SET TERMINATOR @
CREATE OR REPLACE PROCEDURE p_update_leaders_score (
    IN p_school_id INTEGER, p_leader_score INTEGER) 
LANGUAGE SQL 
MODIFIES SQL DATA
BEGIN
    
END 
  @

### Question 2: Inside your stored procedure, write a SQL statement to update the Leaders_Score field in the CHICAGO_PUBLIC_SCHOOLS table for the school identified by in_School_ID to the value in the in_Leader_Score parameter

In [ ]:
--#SET TERMINATOR @
CREATE PROCEDURE p_update_leaders_score (
    IN p_school_id INTEGER, p_leader_score INTEGER) 
LANGUAGE SQL 
MODIFIES SQL DATA
BEGIN
    UPDATE "CHICAGO_PUBLIC_SCHOOLS"
    SET "Leaders_Score" = p_leader_score
    WHERE "School_ID" = p_school_id;
END 
@

### Question 3: Inside your stored procedure, write a SQL IF statement to update the Leaders_Icon field in the CHICAGO_PUBLIC_SCHOOLS table for the school identified by in_School_ID using the following information.

| Score lower limit | Score upper limit | Icon |
| --- | --- | --- |
| 80 | 99 | Very strong |
| 60 | 79 | Strong |
| 40 | 59 | Average |
| 20 | 39 | Weak |
| 0	| 19 | Very weak |

In [54]:
%%sql

DROP PROCEDURE p_update_leaders_score;

CREATE PROCEDURE p_update_leaders_score(IN p_school_id INTEGER, IN p_leader_score INTEGER)
BEGIN

IF p_leader_score >= 80 AND p_leader_score <= 99 THEN
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Very Strong', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;
        
ELSEIF p_leader_score >= 60 AND p_leader_score <=79 THEN
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Strong', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;
        
    ELSEIF p_leader_score >=40 AND p_leader_score <= 59 THEN
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Average', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;
        
ELSEIF p_leader_score >= 20 AND p_leader_score <= 39 THEN
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Weak', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;
        
ELSEIF p_leader_score < 20 AND p_leader_score >= 0 THEN 
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Very Weak', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;

END IF;

END

 * mysql+pymysql://admin:***@database-1.cxbcxwezo94b.us-east-1.rds.amazonaws.com/ibm_database
0 rows affected.
0 rows affected.

[]

### Question 4: Write a query to call the stored procedure, passing a valid school ID and a leader score of 50, to check that the procedure works as expected.

In [47]:
%%sql
CALL p_update_leaders_score(610038, 50);

select
    school_id,
    leaders_icon,
    leaders_score
from CHICAGO_PUBLIC_SCHOOLS WHERE SCHOOL_ID = 610038;

 * mysql+pymysql://admin:***@database-1.cxbcxwezo94b.us-east-1.rds.amazonaws.com/ibm_database
1 rows affected.
1 rows affected.

[(610038, 'Average', '50')]

## Transactions

### Question 1: Update your stored procedure definition. Add a generic ELSE clause to the IF statement that rolls back the current work if the score did not fit any of the preceding categories.

In [55]:
%%sql

DROP PROCEDURE p_update_leaders_score;


CREATE PROCEDURE p_update_leaders_score(IN p_school_id INTEGER, IN p_leader_score INTEGER)
BEGIN

IF p_leader_score >= 80 AND p_leader_score <= 99 THEN
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Very Strong', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;
        
ELSEIF p_leader_score >= 60 AND p_leader_score <=79 THEN
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Strong', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;
        
    ELSEIF p_leader_score >=40 AND p_leader_score <= 59 THEN
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Average', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;
        
ELSEIF p_leader_score >= 20 AND p_leader_score <= 39 THEN
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Weak', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;
        
ELSEIF p_leader_score < 20 AND p_leader_score >= 0 THEN 
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Very Weak', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;

ELSE
    ROLLBACK;

END IF;

END

 * mysql+pymysql://admin:***@database-1.cxbcxwezo94b.us-east-1.rds.amazonaws.com/ibm_database
0 rows affected.
0 rows affected.

[]

### Question 2: Update your stored procedure definition again. Add a statement to commit the current unit of work at the end of the procedure.

In [56]:
%%sql

DROP PROCEDURE p_update_leaders_score;

CREATE PROCEDURE p_update_leaders_score(IN p_school_id INTEGER, IN p_leader_score INTEGER)
BEGIN

IF p_leader_score >= 80 AND p_leader_score <= 99 THEN
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Very Strong', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;
        
ELSEIF p_leader_score >= 60 AND p_leader_score <=79 THEN
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Strong', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;
        
    ELSEIF p_leader_score >=40 AND p_leader_score <= 59 THEN
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Average', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;
        
ELSEIF p_leader_score >= 20 AND p_leader_score <= 39 THEN
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Weak', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;
        
ELSEIF p_leader_score < 20 AND p_leader_score >= 0 THEN 
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET LEADERS_ICON = 'Very Weak', LEADERS_SCORE = p_leader_score
    WHERE SCHOOL_ID = p_school_id;

ELSE
    ROLLBACK;

END IF;

COMMIT;

END

 * mysql+pymysql://admin:***@database-1.cxbcxwezo94b.us-east-1.rds.amazonaws.com/ibm_database
0 rows affected.
0 rows affected.

[]

### Question 3: Write and run one query to check that the updated stored procedure works as expected when you use a valid score of 38.

In [58]:
%%sql
CALL p_update_leaders_score(610038, 38);

select
	school_id,
    leaders_icon,
    leaders_score
from CHICAGO_PUBLIC_SCHOOLS WHERE SCHOOL_ID = 610038;

 * mysql+pymysql://admin:***@database-1.cxbcxwezo94b.us-east-1.rds.amazonaws.com/ibm_database
0 rows affected.
1 rows affected.

[(610038, 'Weak', '38')]

### Question 4: Write and run another query to check that the updated stored procedure works as expected when you use an invalid score of 101.

In [59]:
%%sql
CALL p_update_leaders_score(610038, 101);

select
	school_id,
    leaders_icon,
    leaders_score
from CHICAGO_PUBLIC_SCHOOLS WHERE SCHOOL_ID = 610038;

 * mysql+pymysql://admin:***@database-1.cxbcxwezo94b.us-east-1.rds.amazonaws.com/ibm_database
0 rows affected.
1 rows affected.

[(610038, 'Weak', '38')]